package HW04;

public class hw04 {
    /*1. Создайте программу, выводящую на экран все четырёхзначные числа последовательности
     1000 1003 1006 1009 1012 1015 ….*/
    public static void main(String[] args) {
        for (int count = 1000; count < 2000; count += 3) {
            System.out.println(count);
        }
    }

}
