package HW04;

public class hwex2 {
    //2. Создайте программу, выводящую на экран первые 55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….
    public static void main(String[] args){
        int a = 57;
        for(int b = 1; b<a; b+=2){
            System.out.println(b);
        }
    }
}
